In [1]:
import numpy as np
import pandas as pd

In [2]:
train=pd.read_csv("train_LZdllcl.csv")
test=pd.read_csv("test_2umaH9m.csv")

In [3]:
train.head(10)

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted
0,65438,Sales & Marketing,region_7,Master's & above,f,sourcing,1,35,5.0,8,1,0,49,0
1,65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,0,60,0
2,7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,0,50,0
3,2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,0,50,0
4,48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,0,73,0
5,58896,Analytics,region_2,Bachelor's,m,sourcing,2,31,3.0,7,0,0,85,0
6,20379,Operations,region_20,Bachelor's,f,other,1,31,3.0,5,0,0,59,0
7,16290,Operations,region_34,Master's & above,m,sourcing,1,33,3.0,6,0,0,63,0
8,73202,Analytics,region_20,Bachelor's,m,other,1,28,4.0,5,0,0,83,0
9,28911,Sales & Marketing,region_1,Master's & above,m,sourcing,1,32,5.0,5,1,0,54,0

In [4]:
test.head(10)

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score
0,8724,Technology,region_26,Bachelor's,m,sourcing,1,24,NaN,1,1,0,77
1,74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51
2,72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47
3,38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65
4,64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61
5,46232,Procurement,region_7,Bachelor's,m,sourcing,1,36,3.0,2,0,0,68
6,54542,Finance,region_2,Bachelor's,m,other,1,33,5.0,3,1,0,57
7,67269,Analytics,region_22,Bachelor's,m,sourcing,2,36,3.0,3,0,0,85
8,66174,Technology,region_7,Master's & above,m,other,1,51,4.0,11,0,0,75
9,76303,Technology,region_22,Bachelor's,m,sourcing,1,29,5.0,2,1,0,76

In [5]:
train.shape,test.shape

((54808, 14), (23490, 13))

In [6]:
train.columns.tolist()

['employee_id',
 'department',
 'region',
 'education',
 'gender',
 'recruitment_channel',
 'no_of_trainings',
 'age',
 'previous_year_rating',
 'length_of_service',
 'KPIs_met >80%',
 'awards_won?',
 'avg_training_score',
 'is_promoted']

In [7]:
test.columns.tolist()

['employee_id',
 'department',
 'region',
 'education',
 'gender',
 'recruitment_channel',
 'no_of_trainings',
 'age',
 'previous_year_rating',
 'length_of_service',
 'KPIs_met >80%',
 'awards_won?',
 'avg_training_score']

In [9]:
train.shape,test.shape

((54808, 14), (23490, 13))

In [8]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 54808 entries, 0 to 54807
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   employee_id           54808 non-null  int64
 1   department            54808 non-null  object
 2   region                54808 non-null  object
 3   education             52399 non-null  object
 4   gender                54808 non-null  object
 5   recruitment_channel   54808 non-null  object
 6   no_of_trainings       54808 non-null  int64
 7   age                   54808 non-null  int64
 8   previous_year_rating  50684 non-null  float64
 9   length_of_service     54808 non-null  int64
 10  KPIs_met >80%         54808 non-null  int64
 11  awards_won?           54808 non-null  int64
 12  avg_training_score    54808 non-null  int64
 13  is_promoted           54808 non-null  int64
dtypes: float64(1), int64(8), object(5)
memory usage: 5.9+ MB

In [10]:
k=int(train['previous_year_rating'].mean())
train['previous_year_rating'].fillna(value=k,inplace=True)
m=int(test['previous_year_rating'].mean())
test['previous_year_rating'].fillna(value=m,inplace=True)

In [12]:
train["education"].fillna(value="Not Available",inplace=True)
test["education"].fillna(value="Not Available",inplace=True)

In [13]:
train.describe(include="all")

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted
count,54808.000000,54808,54808,54808,54808,54808,54808.000000,54808.000000,54808.000000,54808.000000,54808.000000,54808.000000,54808.000000,54808.000000
unique,NaN,9,34,4,2,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Sales & Marketing,region_2,Bachelor's,m,other,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,16840,12343,36669,38496,30446,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,39195.830627,NaN,NaN,NaN,NaN,NaN,1.253011,34.803915,3.304481,5.865512,0.351974,0.023172,63.386750,0.085170
std,22586.581449,NaN,NaN,NaN,NaN,NaN,0.609264,7.660169,1.214770,4.265094,0.477590,0.150450,13.371559,0.279137
min,1.000000,NaN,NaN,NaN,NaN,NaN,1.000000,20.000000,1.000000,1.000000,0.000000,0.000000,39.000000,0.000000
25%,19669.750000,NaN,NaN,NaN,NaN,NaN,1.000000,29.000000,3.000000,3.000000,0.000000,0.000000,51.000000,0.000000
50%,39225.500000,NaN,NaN,NaN,NaN,NaN,1.000000,33.000000,3.000000,5.000000,0.000000,0.000000,60.000000,0.000000
75%,58730.500000,NaN,NaN,NaN,NaN,NaN,1.000000,39.000000,4.000000,7.000000,1.000000,0.000000,76.000000,0.000000
max,78298.000000,NaN,NaN,NaN,NaN,NaN,10.000000,60.000000,5.000000,37.000000,1.000000,1.000000,99.000000,1.000000

In [14]:
test.describe(include="all")

,employee_id,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score
count,23490.000000,23490,23490,23490,23490,23490,23490.000000,23490.000000,23490.000000,23490.000000,23490.000000,23490.000000,23490.000000
unique,NaN,9,34,4,2,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,Sales & Marketing,region_2,Bachelor's,m,other,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,7315,5299,15578,16596,13078,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,39041.399149,NaN,NaN,NaN,NaN,NaN,1.254236,34.782929,3.312984,5.810387,0.358834,0.022776,63.263133
std,22640.809201,NaN,NaN,NaN,NaN,NaN,0.600910,7.679492,1.216959,4.207917,0.479668,0.149191,13.411750
min,3.000000,NaN,NaN,NaN,NaN,NaN,1.000000,20.000000,1.000000,1.000000,0.000000,0.000000,39.000000
25%,19370.250000,NaN,NaN,NaN,NaN,NaN,1.000000,29.000000,3.000000,3.000000,0.000000,0.000000,51.000000
50%,38963.500000,NaN,NaN,NaN,NaN,NaN,1.000000,33.000000,3.000000,5.000000,0.000000,0.000000,60.000000
75%,58690.000000,NaN,NaN,NaN,NaN,NaN,1.000000,39.000000,4.000000,7.000000,1.000000,0.000000,76.000000
max,78295.000000,NaN,NaN,NaN,NaN,NaN,9.000000,60.000000,5.000000,34.000000,1.000000,1.000000,99.000000

In [15]:
train.set_index("employee_id",inplace=True)
test.set_index("employee_id",inplace=True)

In [18]:
train.head()

,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted
employee_id,,,,,,,,,,,,,
65438,Sales & Marketing,region_7,Master's & above,f,sourcing,1,35,5.0,8,1,0,49,0
65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,0,60,0
7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,0,50,0
2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,0,50,0
48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,0,73,0

In [19]:
test.head()

,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score
employee_id,,,,,,,,,,,,
8724,Technology,region_26,Bachelor's,m,sourcing,1,24,3.0,1,1,0,77
74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51
72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47
38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65
64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61

In [23]:
train.groupby('department')["no_of_trainings"].describe()

                     count      mean       std  min  25%  50%  75%   max
department
Analytics           5352.0  1.337818  0.587229  1.0  1.0  1.0  2.0   4.0
Finance             2536.0  1.304022  0.605888  1.0  1.0  1.0  1.0   5.0
HR                  2418.0  1.053763  0.232817  1.0  1.0  1.0  1.0   3.0
Legal               1039.0  1.089509  0.383518  1.0  1.0  1.0  1.0   3.0
Operations         11348.0  1.160821  0.427888  1.0  1.0  1.0  1.0   5.0
Procurement         7138.0  1.322779  0.793726  1.0  1.0  1.0  1.0  10.0
R&D                  999.0  1.402402  0.700869  1.0  1.0  1.0  2.0   5.0
Sales & Marketing  16840.0  1.277435  0.660753  1.0  1.0  1.0  1.0  10.0
Technology          7138.0  1.260857  0.596130  1.0  1.0  1.0  1.0   7.0

In [25]:
test.groupby('department')["no_of_trainings"].describe()

                    count      mean       std  min  25%  50%  75%  max
department
Analytics          2319.0  1.348426  0.589845  1.0  1.0  1.0  2.0  5.0
Finance            1091.0  1.313474  0.628667  1.0  1.0  1.0  1.0  5.0
HR                 1085.0  1.065438  0.272263  1.0  1.0  1.0  1.0  3.0
Legal               445.0  1.076404  0.353242  1.0  1.0  1.0  1.0  3.0
Operations         4764.0  1.174643  0.442991  1.0  1.0  1.0  1.0  5.0
Procurement        3020.0  1.340397  0.808630  1.0  1.0  1.0  1.0  9.0
R&D                 440.0  1.352273  0.682348  1.0  1.0  1.0  2.0  5.0
Sales & Marketing  7315.0  1.268216  0.629656  1.0  1.0  1.0  1.0  7.0
Technology         3011.0  1.245766  0.564784  1.0  1.0  1.0  1.0  6.0

In [28]:
train.groupby('department')['age'].describe()

                     count       mean       std   min   25%   50%   75%   max
department
Analytics           5352.0  32.431241  5.994745  20.0  28.0  31.0  35.0  60.0
Finance             2536.0  32.058754  6.521766  20.0  28.0  31.0  35.0  60.0
HR                  2418.0  34.385856  8.608311  20.0  28.0  32.0  38.0  60.0
Legal               1039.0  33.832531  7.398306  23.0  29.0  32.0  37.0  60.0
Operations         11348.0  36.073669  7.496754  20.0  31.0  35.0  40.0  60.0
Procurement         7138.0  35.899972  7.998411  20.0  30.0  34.0  40.0  60.0
R&D                  999.0  32.842843  4.544627  24.0  30.0  32.0  36.0  50.0
Sales & Marketing  16840.0  34.860629  7.769406  20.0  29.0  33.0  39.0  60.0
Technology          7138.0  34.867190  8.090095  20.0  29.0  33.0  39.0  60.0

In [26]:
test.groupby('department')['age'].describe()

                    count       mean       std   min   25%   50%   75%   max
department
Analytics          2319.0  32.354463  5.928559  20.0  28.0  31.0  35.0  59.0
Finance            1091.0  32.471127  6.977542  22.0  28.0  31.0  35.0  60.0
HR                 1085.0  34.290323  8.608090  20.0  28.0  32.0  38.0  60.0
Legal               445.0  33.786517  7.385266  24.0  29.0  32.0  37.0  60.0
Operations         4764.0  36.110202  7.551699  20.0  31.0  35.0  40.0  60.0
Procurement        3020.0  36.130795  8.175277  20.0  30.0  34.0  40.0  60.0
R&D                 440.0  32.820455  4.427296  24.0  30.0  32.0  35.0  49.0
Sales & Marketing  7315.0  34.665755  7.612539  20.0  29.0  33.0  39.0  60.0
Technology         3011.0  34.935237  8.239770  20.0  29.0  33.0  39.0  60.0

In [29]:
train.groupby('department')['length_of_service'].describe()

                     count      mean       std  min  25%  50%  75%   max
department
Analytics           5352.0  4.932735  3.354521  1.0  3.0  4.0  7.0  34.0
Finance             2536.0  4.819401  3.613654  1.0  2.0  4.0  6.0  33.0
HR                  2418.0  5.683623  4.408166  1.0  3.0  5.0  7.0  33.0
Legal               1039.0  4.599615  3.850961  1.0  2.0  4.0  6.0  32.0
Operations         11348.0  6.416020  4.359909  1.0  3.0  5.0  8.0  34.0
Procurement         7138.0  6.331045  4.532367  1.0  3.0  5.0  8.0  32.0
R&D                  999.0  4.554555  2.749162  1.0  3.0  4.0  6.0  20.0
Sales & Marketing  16840.0  5.912292  4.292995  1.0  3.0  5.0  8.0  37.0
Technology          7138.0  5.914822  4.510480  1.0  3.0  5.0  7.0  34.0

In [27]:
test.groupby('department')['length_of_service'].describe()

                    count      mean       std  min  25%  50%  75%   max
department
Analytics          2319.0  4.956878  3.373480  1.0  3.0  4.0  7.0  28.0
Finance            1091.0  5.005500  3.541622  1.0  2.0  4.0  7.0  31.0
HR                 1085.0  5.626728  4.303717  1.0  3.0  5.0  7.0  30.0
Legal               445.0  4.602247  3.477274  1.0  2.0  4.0  6.0  21.0
Operations         4764.0  6.414777  4.447572  1.0  3.0  5.0  8.0  34.0
Procurement        3020.0  6.238742  4.418669  1.0  3.0  5.0  8.0  31.0
R&D                 440.0  4.750000  2.984585  1.0  2.0  4.0  6.0  18.0
Sales & Marketing  7315.0  5.778947  4.200042  1.0  3.0  5.0  7.0  32.0
Technology         3011.0  5.849552  4.406083  1.0  3.0  5.0  7.0  34.0

In [30]:
train.groupby('department')['previous_year_rating'].describe()

                     count      mean       std  min  25%  50%  75%  max
department
Analytics           5352.0  3.508782  1.157038  1.0  3.0  3.0  5.0  5.0
Finance             2536.0  3.449921  1.091412  1.0  3.0  3.0  4.0  5.0
HR                  2418.0  3.433830  1.132861  1.0  3.0  3.0  4.0  5.0
Legal               1039.0  3.339750  1.129849  1.0  3.0  3.0  4.0  5.0
Operations         11348.0  3.599401  1.136993  1.0  3.0  4.0  5.0  5.0
Procurement         7138.0  3.280891  1.148972  1.0  3.0  3.0  4.0  5.0
R&D                  999.0  3.514515  1.148991  1.0  3.0  3.0  5.0  5.0
Sales & Marketing  16840.0  3.062648  1.316997  1.0  2.0  3.0  4.0  5.0
Technology          7138.0  3.146540  1.131331  1.0  3.0  3.0  4.0  5.0

In [31]:
test.groupby('department')['previous_year_rating'].describe()

                    count      mean       std  min  25%  50%  75%  max
department
Analytics          2319.0  3.482104  1.137449  1.0  3.0  3.0  4.0  5.0
Finance            1091.0  3.485793  1.136763  1.0  3.0  3.0  5.0  5.0
HR                 1085.0  3.477419  1.162410  1.0  3.0  3.0  5.0  5.0
Legal               445.0  3.393258  1.211971  1.0  3.0  3.0  5.0  5.0
Operations         4764.0  3.623636  1.117135  1.0  3.0  4.0  5.0  5.0
Procurement        3020.0  3.248013  1.156693  1.0  3.0  3.0  4.0  5.0
R&D                 440.0  3.600000  1.102493  1.0  3.0  3.0  5.0  5.0
Sales & Marketing  7315.0  3.082980  1.326031  1.0  2.0  3.0  4.0  5.0
Technology         3011.0  3.139489  1.118764  1.0  3.0  3.0  4.0  5.0

In [32]:
train.groupby('department')['avg_training_score'].describe()

                     count       mean       std   min   25%   50%   75%   max
department
Analytics           5352.0  84.602952  2.855495  75.0  83.0  85.0  86.0  99.0
Finance             2536.0  60.222003  4.929564  50.0  58.0  60.0  62.0  98.0
HR                  2418.0  50.018197  4.680137  40.0  48.0  50.0  51.0  97.0
Legal               1039.0  59.868142  4.103776  52.0  58.0  60.0  61.0  97.0
Operations         11348.0  60.226648  4.818071  50.0  58.0  60.0  62.0  99.0
Procurement         7138.0  70.122443  4.305110  60.0  68.0  70.0  72.0  99.0
R&D                  999.0  84.596597  2.921215  73.0  83.0  85.0  86.0  98.0
Sales & Marketing  16840.0  50.261698  5.551414  39.0  48.0  50.0  52.0  99.0
Technology          7138.0  79.928692  3.355511  68.0  78.0  80.0  82.0  99.0

In [33]:
test.groupby('department')['avg_training_score'].describe()

                    count       mean       std   min   25%   50%   75%   max
department
Analytics          2319.0  84.541182  2.888182  72.0  83.0  84.0  86.0  99.0
Finance            1091.0  60.322640  4.982394  50.0  58.0  60.0  62.0  97.0
HR                 1085.0  50.305991  5.482647  41.0  48.0  50.0  52.0  98.0
Legal               445.0  59.575281  3.512759  51.0  57.0  59.0  62.0  91.0
Operations         4764.0  60.300798  5.038003  49.0  58.0  60.0  62.0  99.0
Procurement        3020.0  70.146026  4.229214  61.0  68.0  70.0  72.0  99.0
R&D                 440.0  84.413636  2.956294  76.0  82.0  84.0  86.0  96.0
Sales & Marketing  7315.0  50.085988  5.211089  39.0  48.0  50.0  51.0  99.0
Technology         3011.0  79.860511  3.380097  69.0  78.0  80.0  82.0  99.0

In [36]:
train.groupby('department')['KPIs_met >80%'].describe()

                     count      mean       std  min  25%  50%  75%  max
department
Analytics           5352.0  0.404148  0.490772  0.0  0.0  0.0  1.0  1.0
Finance             2536.0  0.414826  0.492789  0.0  0.0  0.0  1.0  1.0
HR                  2418.0  0.334160  0.471794  0.0  0.0  0.0  1.0  1.0
Legal               1039.0  0.333975  0.471858  0.0  0.0  0.0  1.0  1.0
Operations         11348.0  0.430737  0.495201  0.0  0.0  0.0  1.0  1.0
Procurement         7138.0  0.377557  0.484810  0.0  0.0  0.0  1.0  1.0
R&D                  999.0  0.416416  0.493211  0.0  0.0  0.0  1.0  1.0
Sales & Marketing  16840.0  0.265083  0.441391  0.0  0.0  0.0  1.0  1.0
Technology          7138.0  0.344354  0.475190  0.0  0.0  0.0  1.0  1.0

In [37]:
test.groupby('department')['KPIs_met >80%'].describe()

                    count      mean       std  min  25%  50%  75%  max
department
Analytics          2319.0  0.404053  0.490814  0.0  0.0  0.0  1.0  1.0
Finance            1091.0  0.396884  0.489476  0.0  0.0  0.0  1.0  1.0
HR                 1085.0  0.349309  0.476972  0.0  0.0  0.0  1.0  1.0
Legal               445.0  0.341573  0.474771  0.0  0.0  0.0  1.0  1.0
Operations         4764.0  0.444165  0.496925  0.0  0.0  0.0  1.0  1.0
Procurement        3020.0  0.377483  0.484838  0.0  0.0  0.0  1.0  1.0
R&D                 440.0  0.440909  0.497061  0.0  0.0  0.0  1.0  1.0
Sales & Marketing  7315.0  0.276418  0.447257  0.0  0.0  0.0  1.0  1.0
Technology         3011.0  0.350714  0.477273  0.0  0.0  0.0  1.0  1.0

In [38]:
train.groupby('education')["no_of_trainings"].describe()

                    count      mean       std  min  25%  50%  75%   max
education
Bachelor's        36669.0  1.270883  0.633341  1.0  1.0  1.0  1.0  10.0
Below Secondary     805.0  1.275776  0.621723  1.0  1.0  1.0  1.0   4.0
Master's & above  14925.0  1.219095  0.559485  1.0  1.0  1.0  1.0  10.0
Not Available      2409.0  1.183479  0.504507  1.0  1.0  1.0  1.0   6.0

In [39]:
test.groupby('education')["no_of_trainings"].describe()

                    count      mean       std  min  25%  50%  75%  max
education
Bachelor's        15578.0  1.271087  0.619917  1.0  1.0  1.0  1.0  9.0
Below Secondary     374.0  1.294118  0.763874  1.0  1.0  1.0  1.0  8.0
Master's & above   6504.0  1.222478  0.555552  1.0  1.0  1.0  1.0  8.0
Not Available      1034.0  1.185687  0.496208  1.0  1.0  1.0  1.0  6.0

In [40]:
train.groupby('education')["age"].describe()

                    count       mean       std   min   25%   50%   75%   max
education
Bachelor's        36669.0  33.445226  7.047381  20.0  29.0  32.0  36.0  60.0
Below Secondary     805.0  23.836025  1.829266  20.0  23.0  24.0  25.0  31.0
Master's & above  14925.0  39.352630  7.070637  20.0  34.0  38.0  43.0  60.0
Not Available      2409.0  30.968867  7.550183  20.0  26.0  29.0  34.0  60.0

In [41]:
test.groupby('education')["age"].describe()

                    count       mean       std   min   25%   50%   75%   max
education
Bachelor's        15578.0  33.406086  7.052300  20.0  29.0  32.0  36.0  60.0
Below Secondary     374.0  23.951872  1.761316  20.0  23.0  24.0  25.0  30.0
Master's & above   6504.0  39.340867  7.134473  20.0  34.0  38.0  43.0  60.0
Not Available      1034.0  30.773694  7.177938  20.0  26.0  29.0  34.0  60.0

In [42]:
train.groupby('education')["length_of_service"].describe()

                    count      mean       std  min  25%  50%   75%   max
education
Bachelor's        36669.0  5.344542  3.892569  1.0  3.0  4.0   7.0  37.0
Below Secondary     805.0  1.704348  0.816218  1.0  1.0  2.0   2.0   5.0
Master's & above  14925.0  7.605293  4.725710  1.0  4.0  7.0  10.0  34.0
Not Available      2409.0  4.407223  3.723495  1.0  2.0  3.0   6.0  32.0

In [43]:
test.groupby('education')['length_of_service'].describe()

                    count      mean       std  min  25%  50%  75%   max
education
Bachelor's        15578.0  5.324689  3.899684  1.0  3.0  4.0  7.0  34.0
Below Secondary     374.0  1.754011  0.886855  1.0  1.0  2.0  2.0   5.0
Master's & above   6504.0  7.440959  4.573041  1.0  4.0  7.0  9.0  31.0
Not Available      1034.0  4.338491  3.597828  1.0  2.0  3.0  6.0  25.0

In [44]:
train.groupby('education')["previous_year_rating"].describe()

                    count      mean       std  min  25%  50%  75%  max
education
Bachelor's        36669.0  3.295427  1.211948  1.0  3.0  3.0  4.0  5.0
Below Secondary     805.0  3.280745  0.868572  1.0  3.0  3.0  4.0  5.0
Master's & above  14925.0  3.359464  1.238252  1.0  3.0  3.0  4.0  5.0
Not Available      2409.0  3.109589  1.186348  1.0  3.0  3.0  4.0  5.0

In [45]:
test.groupby('education')["previous_year_rating"].describe()

                    count      mean       std  min  25%  50%  75%  max
education
Bachelor's        15578.0  3.304725  1.215140  1.0  3.0  3.0  4.0  5.0
Below Secondary     374.0  3.331551  0.883097  1.0  3.0  3.0  4.0  5.0
Master's & above   6504.0  3.366544  1.242796  1.0  3.0  3.0  4.0  5.0
Not Available      1034.0  3.093810  1.156613  1.0  3.0  3.0  4.0  5.0

In [46]:
train.groupby('education')["avg_training_score"].describe()

                    count       mean        std   min   25%   50%   75%   max
education
Bachelor's        36669.0  63.422046  13.365371  39.0  51.0  60.0  76.0  99.0
Below Secondary     805.0  64.925466  11.249960  43.0  57.0  62.0  75.0  97.0
Master's & above  14925.0  64.061240  13.219803  40.0  52.0  61.0  76.0  99.0
Not Available      2409.0  58.156496  13.892265  40.0  49.0  52.0  62.0  98.0

In [47]:
test.groupby('education')["avg_training_score"].describe()

                    count       mean        std   min   25%   50%    75%   max
education
Bachelor's        15578.0  63.172936  13.440785  40.0  51.0  60.0  76.00  99.0
Below Secondary     374.0  65.422460  11.048182  43.0  58.0  62.0  74.75  93.0
Master's & above   6504.0  64.114391  13.199512  39.0  52.0  62.0  76.00  99.0
Not Available      1034.0  58.486460  13.994962  41.0  49.0  51.0  64.75  96.0

In [48]:
train.groupby('education')["KPIs_met >80%"].describe()

                    count      mean       std  min  25%  50%  75%  max
education
Bachelor's        36669.0  0.354496  0.478367  0.0  0.0  0.0  1.0  1.0
Below Secondary     805.0  0.400000  0.490203  0.0  0.0  0.0  1.0  1.0
Master's & above  14925.0  0.360134  0.480055  0.0  0.0  0.0  1.0  1.0
Not Available      2409.0  0.246990  0.431351  0.0  0.0  0.0  0.0  1.0

In [49]:
test.groupby('education')["KPIs_met >80%"].describe()

                    count      mean       std  min  25%  50%  75%  max
education
Bachelor's        15578.0  0.360316  0.480107  0.0  0.0  0.0  1.0  1.0
Below Secondary     374.0  0.438503  0.496868  0.0  0.0  0.0  1.0  1.0
Master's & above   6504.0  0.364852  0.481426  0.0  0.0  0.0  1.0  1.0
Not Available      1034.0  0.269826  0.444084  0.0  0.0  0.0  1.0  1.0

In [50]:
train.groupby('age')['is_promoted'].describe()

      count      mean       std  min  25%  50%  75%  max
age
20    113.0  0.035398  0.185607  0.0  0.0  0.0  0.0  1.0
21     98.0  0.051020  0.221171  0.0  0.0  0.0  0.0  1.0
22    231.0  0.077922  0.268631  0.0  0.0  0.0  0.0  1.0
23    428.0  0.079439  0.270740  0.0  0.0  0.0  0.0  1.0
24    845.0  0.082840  0.275804  0.0  0.0  0.0  0.0  1.0
25   1299.0  0.053118  0.224355  0.0  0.0  0.0  0.0  1.0
26   2060.0  0.079126  0.270001  0.0  0.0  0.0  0.0  1.0
27   2827.0  0.092324  0.289534  0.0  0.0  0.0  0.0  1.0
28   3147.0  0.097871  0.297187  0.0  0.0  0.0  0.0  1.0
29   3405.0  0.086344  0.280912  0.0  0.0  0.0  0.0  1.0
30   3665.0  0.088404  0.283920  0.0  0.0  0.0  0.0  1.0
31   3534.0  0.087719  0.282926  0.0  0.0  0.0  0.0  1.0
32   3534.0  0.084041  0.277488  0.0  0.0  0.0  0.0  1.0
33   3210.0  0.099377  0.299214  0.0  0.0  0.0  0.0  1.0
34   3076.0  0.092978  0.290449  0.0  0.0  0.0  0.0  1.0
35   2711.0  0.104390  0.305822  0.0  0.0  0.0  0.0  1.0
36   2517.0  0.082638  0.275389  0.0  0.0  0.0  0.0  1.0
37   2165.0  0.084988  0.278929  0.0  0.0  0.0  0.0  1.0
38   1923.0  0.095684  0.294234  0.0  0.0  0.0  0.0  1.0
39   1695.0  0.094985  0.293281  0.0  0.0  0.0  0.0  1.0
40   1663.0  0.076368  0.265666  0.0  0.0  0.0  0.0  1.0
41   1289.0  0.080683  0.272453  0.0  0.0  0.0  0.0  1.0
42   1149.0  0.079199  0.270167  0.0  0.0  0.0  0.0  1.0
43    992.0  0.077621  0.267709  0.0  0.0  0.0  0.0  1.0
44    847.0  0.082645  0.275507  0.0  0.0  0.0  0.0  1.0
45    760.0  0.063158  0.243407  0.0  0.0  0.0  0.0  1.0
46    697.0  0.061693  0.240770  0.0  0.0  0.0  0.0  1.0
47    557.0  0.048474  0.214959  0.0  0.0  0.0  0.0  1.0
48    557.0  0.078995  0.269973  0.0  0.0  0.0  0.0  1.0
49    441.0  0.074830  0.263416  0.0  0.0  0.0  0.0  1.0
50    521.0  0.059501  0.236787  0.0  0.0  0.0  0.0  1.0
51    389.0  0.087404  0.282789  0.0  0.0  0.0  0.0  1.0
52    351.0  0.079772  0.271327  0.0  0.0  0.0  0.0  1.0
53    364.0  0.038462  0.192572  0.0  0.0  0.0  0.0  1.0
54    313.0  0.076677  0.266505  0.0  0.0  0.0  0.0  1.0
55    294.0  0.061224  0.240150  0.0  0.0  0.0  0.0  1.0
56    264.0  0.079545  0.271102  0.0  0.0  0.0  0.0  1.0
57    238.0  0.021008  0.143714  0.0  0.0  0.0  0.0  1.0
58    213.0  0.075117  0.264202  0.0  0.0  0.0  0.0  1.0
59    209.0  0.081340  0.274012  0.0  0.0  0.0  0.0  1.0
60    217.0  0.064516  0.246238  0.0  0.0  0.0  0.0  1.0

In [51]:
train['department'].describe()

count                 54808
unique                    9
top       Sales & Marketing
freq                  16840
Name: department, dtype: object

In [63]:
train['department'].describe()

count                 54808
unique                    9
top       Sales & Marketing
freq                  16840
Name: department, dtype: object

In [53]:
train["education"].describe()

count          54808
unique             4
top       Bachelor's
freq           36669
Name: education, dtype: object

In [64]:
test["education"].describe()

count          23490
unique             4
top       Bachelor's
freq           15578
Name: education, dtype: object

In [54]:
train['age'].describe()

count    54808.000000
mean        34.803915
std          7.660169
min         20.000000
25%         29.000000
50%         33.000000
75%         39.000000
max         60.000000
Name: age, dtype: float64

In [65]:
test['age'].describe()

count    23490.000000
mean        34.782929
std          7.679492
min         20.000000
25%         29.000000
50%         33.000000
75%         39.000000
max         60.000000
Name: age, dtype: float64

In [56]:
train['no_of_trainings'].describe()

count    54808.000000
mean         1.253011
std          0.609264
min          1.000000
25%          1.000000
50%          1.000000
75%          1.000000
max         10.000000
Name: no_of_trainings, dtype: float64

In [66]:
test['no_of_trainings'].describe()

count    23490.000000
mean         1.254236
std          0.600910
min          1.000000
25%          1.000000
50%          1.000000
75%          1.000000
max          9.000000
Name: no_of_trainings, dtype: float64

In [57]:
train['length_of_service'].describe()

count    54808.000000
mean         5.865512
std          4.265094
min          1.000000
25%          3.000000
50%          5.000000
75%          7.000000
max         37.000000
Name: length_of_service, dtype: float64

In [67]:
test['length_of_service'].describe()

count    23490.000000
mean         5.810387
std          4.207917
min          1.000000
25%          3.000000
50%          5.000000
75%          7.000000
max         34.000000
Name: length_of_service, dtype: float64

In [58]:
train['previous_year_rating'].describe()

count    54808.000000
mean         3.304481
std          1.214770
min          1.000000
25%          3.000000
50%          3.000000
75%          4.000000
max          5.000000
Name: previous_year_rating, dtype: float64

In [68]:
test['previous_year_rating'].describe()

count    23490.000000
mean         3.312984
std          1.216959
min          1.000000
25%          3.000000
50%          3.000000
75%          4.000000
max          5.000000
Name: previous_year_rating, dtype: float64

In [59]:
train['avg_training_score'].describe()

count    54808.000000
mean        63.386750
std         13.371559
min         39.000000
25%         51.000000
50%         60.000000
75%         76.000000
max         99.000000
Name: avg_training_score, dtype: float64

In [69]:
test['avg_training_score'].describe()

count    23490.000000
mean        63.263133
std         13.411750
min         39.000000
25%         51.000000
50%         60.000000
75%         76.000000
max         99.000000
Name: avg_training_score, dtype: float64

In [60]:
train['KPIs_met >80%'].describe()

count    54808.000000
mean         0.351974
std          0.477590
min          0.000000
25%          0.000000
50%          0.000000
75%          1.000000
max          1.000000
Name: KPIs_met >80%, dtype: float64

In [70]:
test['KPIs_met >80%'].describe()

count    23490.000000
mean         0.358834
std          0.479668
min          0.000000
25%          0.000000
50%          0.000000
75%          1.000000
max          1.000000
Name: KPIs_met >80%, dtype: float64

In [61]:
def findBand(age):
    if age <=29:
        return 1
    elif age>29 and age<=33:
        return 2
    elif age>33 and age<=39:
        return 3
    else:
        return 4
train['band'] = train['age'].apply(findBand)
test['band'] = test['age'].apply(findBand)

In [71]:
train.head()

,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,is_promoted,band
employee_id,,,,,,,,,,,,,,
65438,Sales & Marketing,region_7,Master's & above,f,sourcing,1,35,5.0,8,1,0,49,0,3
65141,Operations,region_22,Bachelor's,m,other,1,30,5.0,4,0,0,60,0,2
7513,Sales & Marketing,region_19,Bachelor's,m,sourcing,1,34,3.0,7,0,0,50,0,3
2542,Sales & Marketing,region_23,Bachelor's,m,other,2,39,1.0,10,0,0,50,0,3
48945,Technology,region_26,Bachelor's,m,other,1,45,3.0,2,0,0,73,0,4

In [72]:
test.head()

,department,region,education,gender,recruitment_channel,no_of_trainings,age,previous_year_rating,length_of_service,KPIs_met >80%,awards_won?,avg_training_score,band
employee_id,,,,,,,,,,,,,
8724,Technology,region_26,Bachelor's,m,sourcing,1,24,3.0,1,1,0,77,1
74430,HR,region_4,Bachelor's,f,other,1,31,3.0,5,0,0,51,2
72255,Sales & Marketing,region_13,Bachelor's,m,other,1,31,1.0,4,0,0,47,2
38562,Procurement,region_2,Bachelor's,f,other,3,31,2.0,9,0,0,65,2
64486,Finance,region_29,Bachelor's,m,sourcing,1,30,4.0,7,0,0,61,2